app/controllers/admin_controller.rb

INSERT INTO `users` (`address`, `created_at`, `dob`, `gender`, `name`, `updated_at`) VALUES ('fbd', '2014-03-11 13:54:59', '1-sept-1991', 'Male', 'Ashish', '2014-03-11 13:54:59')
---
  def create
  	#debugger
  	@user = User.new
  	@user.name = params["name"]
  	@user.address = params["address"]
  	@user.gender = params["gender"]
  	@user.dob = params["dob"]
    if @user.save

SELECT `users`.* FROM `users` WHERE ('id') LIMIT 1
---
  def show
    @users = User.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `name` = 'retwrete', `address` = 'rfrefe', `gender` = 'Female', `dob` = '222re', `updated_at` = '2014-03-12 12:27:02' WHERE `users`.`id` = 5
---
  def update

    @user = User.find(params[:id])
      if @user.update(params[:user].permit(:name, :address, :gender, :dob))